yazidta/Flying-Probe-Tester/STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "fatfs.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "lcd_config.h"
#include "encoder.h"
#include "encoder_config.h"
#include "stm32f7xx_hal.h"
#include "TMC2209.h"
#include "TMC2209_configs.h"
#include "servo.h"
#include "fatfs.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */



/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim7;
TIM_HandleTypeDef htim9;
TIM_HandleTypeDef htim10;
TIM_HandleTypeDef htim14;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart5;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
UART_HandleTypeDef huart6;
DMA_HandleTypeDef hdma_uart4_rx;
DMA_HandleTypeDef hdma_uart5_rx;
DMA_HandleTypeDef hdma_usart6_rx;

PCD_HandleTypeDef hpcd_USB_OTG_FS;

/* USER CODE BEGIN PV */

volatile uint8_t es = 0;
volatile uint8_t x = 0;
uint8_t xx = 0;
uint8_t sensorX1;
 uint8_t c = 0;
 float move[] = {100, 40 , 250};


volatile uint8_t Flag =0 ;
int32_t speed = 2000;
int32_t stepsRequired = 30000;
uint32_t SG_RESULT = 0;
uint8_t dir = 0;
volatile uint32_t lastDebounceTime = 0;  // Tracks the last debounce time
const uint32_t debounceDelay = 50;
I2C_HandleTypeDef hi2c1;
SERVO_Handle_TypeDef hservo1 = { .PwmOut = PWM_INIT_HANDLE(&htim14, TIM_CHANNEL_1) };
SERVO_Handle_TypeDef hservo2 = { .PwmOut = PWM_INIT_HANDLE(&htim5, TIM_CHANNEL_1) };


TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
volatile uint32_t spiPre;
uint8_t flag;
Motor motors[MAX_MOTORS]; // Global motor array
Axis axes[MAX_MOTORS_PER_AXIS];


/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USB_OTG_FS_PCD_Init(void);
static void MX_TIM7_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM2_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM14_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM9_Init(void);
static void MX_TIM10_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_UART4_Init(void);
static void MX_UART5_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    if (GPIO_Pin == USER_Btn_Pin) // Check if the interrupt is for the correct button
    {
        // Disable further interrupts for the button

        // Reset the motor steps and trigger motion
    	Flag = 1;


        // Re-enable the interrupt after the motion is complete (done in a later step)

}
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART3_UART_Init();
  MX_USB_OTG_FS_PCD_Init();
  MX_TIM7_Init();
  MX_TIM4_Init();
  MX_TIM2_Init();
  MX_USART2_UART_Init();
  MX_FATFS_Init();
  MX_SPI2_Init();
  MX_TIM3_Init();
  MX_TIM14_Init();
  MX_TIM5_Init();
  MX_TIM9_Init();
  MX_TIM10_Init();
  MX_I2C1_Init();
  MX_USART6_UART_Init();
  MX_UART4_Init();
  MX_UART5_Init();
  /* USER CODE BEGIN 2 */
  SERVO_Init(&hservo1);
  SERVO_Init(&hservo2);

  initializeMotors();
  initializeSystem();
   ENC_Init(&henc1);
   //HAL_TIM_Encoder_Start_IT(&htim4,TIM_CHANNEL_ALL);



  //TMC2209_setMotorsConfiguration(motors,8,1);

   TMC2209_enable_PDNuart(&motors[3]);
   TMC2209_read_ifcnt(&motors[3]);
   TMC2209_SetSpreadCycle(&motors[3], 1);
  // configureGCONF(&motors[2]);
   TMC2209_SetSpeed(&motors[0], 26000);
   TMC2209_SetSpeed(&motors[1], 16000);
   TMC2209_SetSpeed(&motors[2], 26000);
   TMC2209_SetSpeed(&motors[3], 12000);
   //TMC2209_Step(&motors[0], 10000);

   LCD_I2C_Init(&hlcd3);
   LCD_I2C_Clear(&hlcd3);
   LCD_I2C_DisplaySequentialGlossyText(&hlcd3,2);

   spiPre = SD_SPI_HANDLE.Instance->CR1;

   //sd_card_read_gcode();
   spiPre = SD_SPI_HANDLE.Instance->CR1;



  //LCD_I2C_DisplayGlossyText(&hlcd3,1);
//   HAL_Delay(200);
//   LCD_I2C_Clear(&hlcd3);
//Display "Position:" in the first row
  /* USER CODE END 2 */

